{"config": [{"config": {"kernel_constraint": null, "filters": 80, "dtype": "float32", "name": "conv1d", "kernel_regularizer": null, "activation": "relu", "kernel_size": [3], "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 23, 99], "strides": [1], "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "dilation_rate": [1], "bias_regularizer": null}, "class_name": "Conv1D"}, {"config": {"data_format": "channels_last", "name": "flatten", "batch_input_shape": [null, 23, 99], "dtype": "float32", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "activation": "tanh", "activity_regularizer": null, "dtype": "float32", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "dense", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 3000, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"rate": 0.2, "seed": null, "name": "dropout", "noise_shape": null, "dtype": "float32", "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "activation": "tanh", "activity_regularizer": null, "dtype": "float32", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "dense_1", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 1200, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "activation": "tanh", "activity_regularizer": null, "dtype": "float32", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "dense_2", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 500, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "dtype": "float32", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "dense_3", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 200, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "dtype": "float32", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "dense_4", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 200, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "dtype": "float32", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "dense_5", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 200, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"rate": 0.2, "seed": null, "name": "dropout_1", "noise_shape": null, "dtype": "float32", "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "dtype": "float32", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "dense_6", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 200, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "dtype": "float32", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "dense_7", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 200, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "dtype": "float32", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "dense_8", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 200, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "activation": "softmax", "activity_regularizer": null, "dtype": "float32", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "dense_9", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 10, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.1.6-tf", "class_name": "Sequential"}