{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Flatten", "config": {"dtype": "float32", "name": "flatten", "data_format": "channels_last", "batch_input_shape": [null, 13], "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activation": "relu", "kernel_constraint": null, "trainable": true, "units": 128, "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "name": "dense", "use_bias": true, "bias_constraint": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activation": "relu", "kernel_constraint": null, "trainable": true, "units": 60, "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "use_bias": true, "bias_constraint": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activation": "softmax", "kernel_constraint": null, "trainable": true, "units": 10, "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "name": "dense_2", "use_bias": true, "bias_constraint": null}}], "keras_version": "2.1.6-tf"}