{"backend": "tensorflow", "config": [{"config": {"trainable": true, "batch_input_shape": [null, 13], "name": "flatten", "dtype": "float32", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "dtype": "float32", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense", "trainable": true, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "dtype": "float32", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 128, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "dtype": "float32", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1", "trainable": true, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "dtype": "float32", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 60, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "dtype": "float32", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_2", "trainable": true, "activation": "softmax", "kernel_initializer": {"config": {"distribution": "uniform", "dtype": "float32", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 10, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.6-tf"}