{"backend": "tensorflow", "config": [{"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32", "batch_input_shape": [null, 801, 13], "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1], "padding": "same", "bias_constraint": null, "name": "conv1d_8", "strides": [10], "bias_regularizer": null, "filters": 200, "activity_regularizer": null, "kernel_size": [10], "trainable": true, "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv1D"}, {"config": {"name": "flatten_11", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 801, 13], "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32", "kernel_regularizer": null, "name": "dense_43", "kernel_constraint": null, "bias_constraint": null, "units": 200, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "use_bias": true}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32", "kernel_regularizer": null, "name": "dense_44", "kernel_constraint": null, "bias_constraint": null, "units": 128, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "use_bias": true}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32", "kernel_regularizer": null, "name": "dense_45", "kernel_constraint": null, "bias_constraint": null, "units": 70, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "use_bias": true}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "softmax", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32", "kernel_regularizer": null, "name": "dense_46", "kernel_constraint": null, "bias_constraint": null, "units": 10, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "use_bias": true}, "class_name": "Dense"}], "keras_version": "2.1.6-tf", "class_name": "Sequential"}